import numpy as np

#SE1 十字架核3*3
SE1 = np.zeros([3,3])
SE1[0:3, 1] = 1
SE1[1, 0:3] = 1

#SE2 矩形核3*3
SE2 = np.ones([3,3])

#SE3
SE3 = np.zeros([3,3])
SE3[0][0] = 1
SE3[0][2] = 1
SE3[2][0] = 1
SE3[2][2] = 1

#细化变换的8个B
#B1
B1 = np.zeros([3,3])
B1[0,:] = -1
B1[2,:] = 1
B1[1,1] = 1
#B2
B2 = np.zeros([3,3])
B2[1:3,0:2] = 1
B2[0,1] = B2[0,2] = B2[1,2] = -1
#B3
B3 = np.rot90(B1,-1)
#B4
B4 = np.rot90(B2,-1)
#B5
B5 = np.rot90(B3,-1)
#B6
B6 = np.rot90(B4,-1)
#B7
B7 = np.rot90(B5,-1)
#B8
B8 = np.rot90(B6,-1)

B = np.zeros((24,3))
B[0:3] = B1
B[3:6] = B2
B[6:9] = B3
B[9:12] = B4
B[12:15] = B5
B[15:18] = B6
B[18:21] = B7
B[21:24] = B8

#裁剪单元
C = np.zeros((24,3))
C[1,0:2] = 1
C[0,1:3] = -1
C[1,2] = -1
C[2,1:3] = -1
for i in range(1,4):
    C[i*3:i*3+3,:] = np.rot90(C[i*3-3:i*3,:],-1)
C[12:15,:] = -1
C[12,0] = 1
C[13,1] = 1
for i in range(5,8):
    C[i*3:i*3+3,:] = np.rot90(C[i*3-3:i*3,:],-1)



